In [1]:
import pandas as pd
import requests
import pymysql
from bs4 import BeautifulSoup
import time
import requests
import sqlalchemy
from sqlalchemy import inspect
from sqlalchemy import create_engine
from sqlalchemy import create_engine, inspect

In [ ]:
print("SQLAlchemy version:", sqlalchemy.__version__)
print("PyMySQL version:", pymysql.__version__)

In [3]:
# Define the sections that will together form the url.
url = "https://api.api-ninjas.com/v1/city"
header={"X-Api-Key": "qClItv2fg4hGDiVLf6zTNw==rLE3xLfQa0uwZFD0"}
querystring = {"country": "DE", "min_population": "500000", "limit": "5"}

# Reference the sections in the request.
cities = requests.request("GET", url, headers=header, params=querystring)
cities_json = cities.json()
cities_json

[{'name': 'Berlin',
  'latitude': 52.5167,
  'longitude': 13.3833,
  'country': 'DE',
  'population': 3644826,
  'is_capital': True},
 {'name': 'Hamburg',
  'latitude': 53.55,
  'longitude': 10.0,
  'country': 'DE',
  'population': 1841179,
  'is_capital': False},
 {'name': 'Munich',
  'latitude': 48.1372,
  'longitude': 11.5755,
  'country': 'DE',
  'population': 1471508,
  'is_capital': False},
 {'name': 'Cologne',
  'latitude': 50.9422,
  'longitude': 6.9578,
  'country': 'DE',
  'population': 1085664,
  'is_capital': False},
 {'name': 'Frankfurt',
  'latitude': 50.1136,
  'longitude': 8.6797,
  'country': 'DE',
  'population': 753056,
  'is_capital': False}]

In [4]:
cities_df_tosql = pd.DataFrame(cities_json)
cities_df_tosql

        name  latitude  longitude country  population  is_capital
0     Berlin   52.5167    13.3833      DE     3644826        True
1    Hamburg   53.5500    10.0000      DE     1841179       False
2     Munich   48.1372    11.5755      DE     1471508       False
3    Cologne   50.9422     6.9578      DE     1085664       False
4  Frankfurt   50.1136     8.6797      DE      753056       False

In [5]:
cities_df_tosql = cities_df_tosql.drop(["is_capital"], axis=1)
cities_df_tosql

        name  latitude  longitude country  population
0     Berlin   52.5167    13.3833      DE     3644826
1    Hamburg   53.5500    10.0000      DE     1841179
2     Munich   48.1372    11.5755      DE     1471508
3    Cologne   50.9422     6.9578      DE     1085664
4  Frankfurt   50.1136     8.6797      DE      753056

In [ ]:
cities_df_tosql.info()

In [6]:
cities_df_tosql = cities_df_tosql.rename(columns={"name": "city_name"})
# Reorder the columns
cities_df_tosql = cities_df_tosql[['city_name', 'latitude', 'longitude', 'population', 'country']]
cities_df_tosql

   city_name  latitude  longitude  population country
0     Berlin   52.5167    13.3833     3644826      DE
1    Hamburg   53.5500    10.0000     1841179      DE
2     Munich   48.1372    11.5755     1471508      DE
3    Cologne   50.9422     6.9578     1085664      DE
4  Frankfurt   50.1136     8.6797      753056      DE

In [7]:
# Use the to_csv method 
cities_df_tosql.to_csv("cities_df_tosql.csv", index=False)

In [9]:
# Database connection
host = 'wbs-gans-jh-project.cye0p6hkvuel.us-east-1.rds.amazonaws.com'
schema = 'gans_aws_JH'
user = 'admin'
password = 'codta1-kabdoV-zutwew'
port = 3306
con = f'mysql+pymysql://{user}:{password}@{host}:{port}/{schema}'

In [11]:
#table cities to sql DONE!
cities_df_tosql.to_sql('cities', con=con, if_exists='append', index=False)

5